ahmadawais.shades-of-purple
dbaeumer.vscode-eslint
donjayamanne.githistory
dracula-theme.theme-dracula
EditorConfig.EditorConfig
enkia.tokyo-night
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
golang.go
ionutvmi.path-autocomplete
mikestead.dotenv
mkaufman.HTMLHint
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
oderwat.indent-rainbow
PKief.material-icon-theme
shardulm94.trailing-spaces
steoates.autoimport
streetsidesoftware.code-spell-checker
tht13.python
vincaslt.highlight-matching-tag
VisualStudioExptTeam.vscodeintellicode
wayou.vscode-todo-highlight
wesbos.theme-cobalt2
wix.vscode-import-cost
