tap "go-delve/delve"
# All in one for **env
brew "anyenv"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line fuzzy finder written in Go
brew "fzf"
# Cat alternative written in Go
brew "gat"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Node version management
brew "n"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Universal database tool and SQL client
cask "dbeaver-community"
# Reimagine your terminal
cask "fig"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "golang.go"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
